zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
/***********************************************************************************************//**
 * \file cyabs_rtos_rtxv5.c
 *
 * \brief
 * Implementation for CMSIS RTOS v2 abstraction
 *
 ***************************************************************************************************
 * \copyright
 * (c) 2019-2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG.  SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/

#include <stdlib.h>
#include <cy_utils.h>
#include <cyabs_rtos.h>
#include "cyabs_rtos_internal.h"

#if defined(__cplusplus)
extern "C" {
#endif

#define CY_RTOS_THREAD_FLAG 0x01

/******************************************************
*                 Error Converter
******************************************************/

// Last received error status
static cy_rtos_error_t dbgErr;


//--------------------------------------------------------------------------------------------------
// cy_rtos_last_error
//--------------------------------------------------------------------------------------------------
cy_rtos_error_t cy_rtos_last_error(void)
{
    return dbgErr;
}


//--------------------------------------------------------------------------------------------------
// error_converter
//
// Converts internal error type to external error type
//--------------------------------------------------------------------------------------------------
static cy_rslt_t error_converter(cy_rtos_error_t internalError)
{
    cy_rslt_t value;

    switch (internalError)
    {
        case osOK:
            value = CY_RSLT_SUCCESS;
            break;

        case osErrorTimeout:
            value = CY_RTOS_TIMEOUT;
            break;

        case osErrorParameter:
            value = CY_RTOS_BAD_PARAM;
            break;

        case osErrorNoMemory:
            value = CY_RTOS_NO_MEMORY;
            break;

        case osError:
        case osErrorResource:
        case osErrorISR:
        default:
            value = CY_RTOS_GENERAL_ERROR;
            break;
    }

    // Update the last known error status
    dbgErr = internalError;
    return value;
}


//--------------------------------------------------------------------------------------------------
// convert_ms_to_ticks
//--------------------------------------------------------------------------------------------------
static uint32_t convert_ms_to_ticks(cy_time_t timeout_ms)
{
    if (timeout_ms == CY_RTOS_NEVER_TIMEOUT)
    {
        return osWaitForever;
    }
    else if (timeout_ms == 0)
    {
        return 0;
    }
    else
    {
        // Get number of ticks per second
        uint32_t tick_freq = osKernelGetTickFreq();
        uint32_t ticks = (uint32_t)(((uint64_t)timeout_ms * tick_freq) / 1000);

        if (ticks == 0)
        {
            ticks = 1;
        }
        else if (ticks >= UINT32_MAX)
        {
            // if ticks if more than 32 bits, change ticks to max possible value that isn't
            // osWaitForever.
            ticks = UINT32_MAX - 1;
        }
        return ticks;
    }
}


/******************************************************
*                 Threads
******************************************************/

cy_rslt_t cy_rtos_thread_create(cy_thread_t* thread, cy_thread_entry_fn_t entry_function,
                                const char* name, void* stack, uint32_t stack_size,
                                cy_thread_priority_t priority, cy_thread_arg_t arg)
{
    cy_rslt_t      status = CY_RSLT_SUCCESS;

    if ((thread == NULL) || (stack_size < CY_RTOS_MIN_STACK_SIZE))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else if ((stack != NULL) && (0 != (((uint32_t)stack) & CY_RTOS_ALIGNMENT_MASK)))
    {
        status = CY_RTOS_ALIGNMENT_ERROR;
    }
    else
    {
        osThreadAttr_t attr =
        {
            .name       = name,
            .attr_bits  = osThreadJoinable,
            .cb_size    = osRtxThreadCbSize,
            .stack_size = stack_size,
            .priority   = (osPriority_t)priority,
            .tz_module  = 0,
        };

        // Allocate stack if NULL was passed
        if ((uint32_t*)stack == NULL)
        {
            // Note: 1 malloc so that it can be freed with 1 call when terminating
            uint32_t cb_mem_pad = (~osRtxThreadCbSize + 1) & CY_RTOS_ALIGNMENT_MASK;
            attr.cb_mem = malloc(osRtxThreadCbSize + cb_mem_pad + stack_size);
            if (attr.cb_mem != NULL)
            {
                attr.stack_mem =
                    (uint32_t*)((uint32_t)attr.cb_mem + osRtxThreadCbSize + cb_mem_pad);
            }
        }
        else
        {
            attr.cb_mem    = malloc(osRtxThreadCbSize);
            attr.stack_mem = stack;
        }

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            CY_ASSERT(((uint32_t)attr.stack_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *thread = osThreadNew((osThreadFunc_t)entry_function, arg, &attr);
            CY_ASSERT((*thread == attr.cb_mem) || (*thread == NULL));
            status = (*thread == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_exit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_exit(void)
{
    // This does not have a return statement because the osThreadExit() function * does not return
    // so the return statement would be unreachable and causes a * warning for IAR compiler.
    osThreadExit();
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_terminate
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_terminate(const cy_thread_t* thread)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

