zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osThreadTerminate(*thread);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_is_running
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_is_running(const cy_thread_t* thread, bool* running)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((thread == NULL) || (running == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *running = (osThreadGetState(*thread) == osThreadRunning) ? true : false;
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_state
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_state(const cy_thread_t* thread, cy_thread_state_t* state)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((thread == NULL) || (state == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        switch (osThreadGetState(*thread))
        {
            case osThreadInactive:
                *state = CY_THREAD_STATE_INACTIVE;
                break;

            case osThreadReady:
                *state = CY_THREAD_STATE_READY;
                break;

            case osThreadRunning:
                *state = CY_THREAD_STATE_RUNNING;
                break;

            case osThreadBlocked:
                *state = CY_THREAD_STATE_BLOCKED;
                break;

            case osThreadTerminated:
                *state = CY_THREAD_STATE_TERMINATED;
                break;

            case osThreadError:
            case osThreadReserved:
            default:
                *state = CY_THREAD_STATE_UNKNOWN;
                break;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_join
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_join(cy_thread_t* thread)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osThreadJoin(*thread);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*thread);
            *thread = NULL;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_handle
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_handle(cy_thread_t* thread)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *thread = osThreadGetId();
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_wait_notification
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_wait_notification(cy_time_t timeout_ms)
{
    uint32_t ret;
    cy_rslt_t status = CY_RSLT_SUCCESS;
    ret = osThreadFlagsWait(CY_RTOS_THREAD_FLAG, osFlagsWaitAll, convert_ms_to_ticks(timeout_ms));
    if (ret & osFlagsError)
    {
        status = (ret == osFlagsErrorTimeout) ? CY_RTOS_TIMEOUT : CY_RTOS_GENERAL_ERROR;
        // Update the last known error status
        dbgErr = (cy_rtos_error_t)ret;
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_set_notification
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_set_notification(const cy_thread_t* thread)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t ret;

    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        /* According to the description of CMSIS-RTOS v2
         * osThreadFlagsSet() can be called inside ISR
         */
        ret = osThreadFlagsSet(*thread, CY_RTOS_THREAD_FLAG);
        if (ret & osFlagsError)
        {
            status = CY_RTOS_GENERAL_ERROR;
            // Update the last known error status
            dbgErr = (cy_rtos_error_t)ret;
        }
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_name
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_name(const cy_thread_t* thread, const char** thread_name)
{
    *thread_name = osThreadGetName(*thread);
    return CY_RSLT_SUCCESS;
}


/******************************************************
*                 Scheduler
******************************************************/
static uint16_t _cy_rtos_suspend_count = 0;
static uint32_t _cy_rtos_suspend_ticks = 0;

//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_suspend
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_suspend(void)
{
    if (_cy_rtos_suspend_count == 0)
    {
        _cy_rtos_suspend_ticks = osKernelSuspend();
        osKernelLock();
    }
    ++_cy_rtos_suspend_count;

    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_resume
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_resume(void)
{
    cy_rslt_t status;
    if (_cy_rtos_suspend_count > 0)
    {
        --_cy_rtos_suspend_count;
        if (_cy_rtos_suspend_count == 0)
        {
            osKernelUnlock();
            osKernelResume(_cy_rtos_suspend_ticks);
        }
        status = CY_RSLT_SUCCESS;
    }
    else
    {
        status = CY_RTOS_BAD_PARAM;
    }

