zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_get_state
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_get_state(cy_scheduler_state_t* state)
{
    cy_rslt_t status;
    if (state == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        osKernelState_t st = osKernelGetState();
        switch (st)
        {
            case osKernelInactive:
                *state = CY_SCHEDULER_STATE_INACTIVE;
                break;

            case osKernelLocked:
                *state = CY_SCHEDULER_STATE_LOCKED;
                break;

            case osKernelReady:
                *state = CY_SCHEDULER_STATE_READY;
                break;

            case osKernelSuspended:
                *state = CY_SCHEDULER_STATE_SUSPENDED;
                break;

            case osKernelRunning:
                *state = CY_SCHEDULER_STATE_RUNNING;
                break;

            case osKernelError:
            case osKernelReserved:
            default:
                *state = CY_SCHEDULER_STATE_UNKNOWN;
                break;
        }

        status = CY_RSLT_SUCCESS;
    }
    return status;
}


/******************************************************
*                 Mutexes
******************************************************/

cy_rslt_t cy_rtos_mutex_init(cy_mutex_t* mutex, bool recursive)
{
    cy_rslt_t     status;
    osMutexAttr_t attr;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = osMutexPrioInherit;
        if (recursive)
        {
            attr.attr_bits |= osMutexRecursive;
        }
        attr.cb_mem  = malloc(osRtxMutexCbSize);
        attr.cb_size = osRtxMutexCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *mutex = osMutexNew(&attr);
            CY_ASSERT((*mutex == attr.cb_mem) || (*mutex == NULL));
            status = (*mutex == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_get(const cy_mutex_t* mutex, cy_time_t timeout_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMutexAcquire(*mutex, timeout_ms);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_set
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_set(const cy_mutex_t* mutex)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMutexRelease(*mutex);
        status         = error_converter(statusInternal);
    }

    return status;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; this backend deinit updates handle state.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_deinit(cy_mutex_t* mutex)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMutexDelete(*mutex);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*mutex);
            *mutex = NULL;
        }
    }

    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Semaphores
******************************************************/

cy_rslt_t cy_rtos_semaphore_init(cy_semaphore_t* semaphore, uint32_t maxcount, uint32_t initcount)
{
    cy_rslt_t         status;
    osSemaphoreAttr_t attr;

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_mem    = malloc(osRtxSemaphoreCbSize);
        attr.cb_size   = osRtxSemaphoreCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *semaphore = osSemaphoreNew(maxcount, initcount, &attr);
            CY_ASSERT((*semaphore == attr.cb_mem) || (*semaphore == NULL));
            status = (*semaphore == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_get(const cy_semaphore_t* semaphore, cy_time_t timeout_ms)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;
    bool in_isr = is_in_isr();
    // Based on documentation when osSemaphoreAcquire is called from ISR timeout must be zero.
    // https://www.keil.com/pack/doc/CMSIS/RTOS2/html/group__CMSIS__RTOS__SemaphoreMgmt.html#ga7e94c8b242a0c81f2cc79ec22895c87b
    if ((semaphore == NULL) || (in_isr && (timeout_ms != 0)))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osSemaphoreAcquire(*semaphore, timeout_ms);
        status = error_converter(statusInternal);
    }

