zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_set
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_set(const cy_semaphore_t* semaphore)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osSemaphoreRelease(*semaphore);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_get_count
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_get_count(const cy_semaphore_t* semaphore, size_t* count)
{
    cy_rslt_t status;
    if ((semaphore == NULL) || (count == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *count = osSemaphoreGetCount(*semaphore);
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; this backend deinit updates handle state.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_deinit(cy_semaphore_t* semaphore)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osSemaphoreDelete(*semaphore);
        status         = error_converter(statusInternal);
        if (status == CY_RSLT_SUCCESS)
        {
            free(*semaphore);
            *semaphore = NULL;
        }
    }

    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Events
******************************************************/

#define CY_RTOS_EVENT_ERRORFLAG     0x80000000UL
#define CY_RTOS_EVENT_FLAGS         0x7FFFFFFFUL

//--------------------------------------------------------------------------------------------------
// cy_rtos_event_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_init(cy_event_t* event)
{
    cy_rslt_t          status;
    osEventFlagsAttr_t attr;

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_mem    = malloc(osRtxEventFlagsCbSize);
        attr.cb_size   = osRtxEventFlagsCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *event = osEventFlagsNew(&attr);
            CY_ASSERT((*event == attr.cb_mem) || (*event == NULL));
            status = (*event == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_setbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_setbits(const cy_event_t* event, uint32_t bits)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = (osStatus_t)osEventFlagsSet(*event, bits);
        if ((statusInternal & CY_RTOS_EVENT_ERRORFLAG) != 0UL)
        {
            status = error_converter(statusInternal);
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_clearbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_clearbits(const cy_event_t* event, uint32_t bits)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = (osStatus_t)osEventFlagsClear(*event, bits);
        if ((statusInternal & CY_RTOS_EVENT_ERRORFLAG) != 0UL)
        {
            status = error_converter(statusInternal);
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_getbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_getbits(const cy_event_t* event, uint32_t* bits)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((event == NULL) || (bits == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *bits = osEventFlagsGet(*event);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_waitbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_waitbits(const cy_event_t* event, uint32_t* bits, bool clear, bool all,
                                 cy_time_t timeout_ms)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;
    uint32_t        flagOption;

    if ((event == NULL) || (bits == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        flagOption = (all) ? osFlagsWaitAll : osFlagsWaitAny;
        if (!clear)
        {
            flagOption |= osFlagsNoClear;
        }

        statusInternal = (osStatus_t)osEventFlagsWait(*event, *bits, flagOption, timeout_ms);
        if ((statusInternal & CY_RTOS_EVENT_ERRORFLAG) == 0UL)
        {
            *bits = statusInternal;
        }
        else
        {
            status = error_converter(statusInternal);
        }
    }

