zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; this backend deinit updates handle state.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_event_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_deinit(cy_event_t* event)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osEventFlagsDelete(*event);
        status         = error_converter(statusInternal);
        if (status == CY_RSLT_SUCCESS)
        {
            free(*event);
            *event = NULL;
        }
    }

    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Queues
******************************************************/

cy_rslt_t cy_rtos_queue_init(cy_queue_t* queue, size_t length, size_t itemsize)
{
    cy_rslt_t            status;
    osMessageQueueAttr_t attr;

    if (queue == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_size   = osRtxMessageQueueCbSize;
        uint32_t blockSize = ((itemsize + 3U) & ~3UL) + sizeof(osRtxMessage_t);
        attr.mq_size = blockSize * length;

        // Note: 1 malloc for both so that they can be freed with 1 call
        uint32_t cb_mem_pad = (8 - (osRtxMessageQueueCbSize & 0x07)) & 0x07;
        attr.cb_mem = malloc(osRtxMessageQueueCbSize + cb_mem_pad + attr.mq_size);
        if (attr.cb_mem != NULL)
        {
            attr.mq_mem = (uint32_t*)((uint32_t)attr.cb_mem + osRtxMessageQueueCbSize + cb_mem_pad);
        }

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            CY_ASSERT(((uint32_t)attr.mq_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *queue = osMessageQueueNew(length, itemsize, &attr);
            CY_ASSERT((*queue == attr.cb_mem) || (*queue == NULL));
            status = (*queue == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_put
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_put(const cy_queue_t* queue, const void* item_ptr, cy_time_t timeout_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;
    bool in_isr = is_in_isr();

    if ((queue == NULL) || (item_ptr == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Not allowed to be called in ISR if timeout != 0
        if ((!in_isr) || (in_isr && (timeout_ms == 0U)))
        {
            statusInternal = osMessageQueuePut(*queue, (uint8_t*)item_ptr, 0u, timeout_ms);
        }
        else
        {
            statusInternal = osErrorISR;
        }

        status = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_get(const cy_queue_t* queue, void* item_ptr, cy_time_t timeout_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;
    bool in_isr = is_in_isr();

    if ((queue == NULL) || (item_ptr == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Not allowed to be called in ISR if timeout != 0
        if ((!in_isr) || (in_isr && (timeout_ms == 0U)))
        {
            statusInternal = osMessageQueueGet(*queue, (uint8_t*)item_ptr, NULL, timeout_ms);
        }
        else
        {
            statusInternal = osErrorISR;
        }

        status = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_count
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_count(const cy_queue_t* queue, size_t* num_waiting)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((queue == NULL) || (num_waiting == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *num_waiting = osMessageQueueGetCount(*queue);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_space
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_space(const cy_queue_t* queue, size_t* num_spaces)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((queue == NULL) || (num_spaces == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *num_spaces = osMessageQueueGetSpace(*queue);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_reset
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_reset(const cy_queue_t* queue)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (queue == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMessageQueueReset(*queue);
        status         = error_converter(statusInternal);
    }

    return status;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; this backend deinit updates handle state.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_deinit(cy_queue_t* queue)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (queue == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMessageQueueDelete(*queue);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*queue);
            *queue = NULL;
        }
    }

