zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Timers
******************************************************/

cy_rslt_t cy_rtos_timer_init(cy_timer_t* timer, cy_timer_trigger_type_t type,
                             cy_timer_callback_t fun, cy_timer_callback_arg_t arg)
{
    cy_rslt_t     status;
    osTimerAttr_t attr;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_mem    = malloc(osRtxTimerCbSize);
        attr.cb_size   = osRtxTimerCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            osTimerType_t osTriggerType = (CY_TIMER_TYPE_PERIODIC == type)
                ? osTimerPeriodic
                : osTimerOnce;

            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *timer = osTimerNew((osTimerFunc_t)fun, osTriggerType, (void*)arg, &attr);
            CY_ASSERT((*timer == attr.cb_mem) || (*timer == NULL));
            status = (*timer == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_start
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_start(const cy_timer_t* timer, cy_time_t num_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osTimerStart(*timer, convert_ms_to_ticks(num_ms));
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_stop
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_stop(const cy_timer_t* timer)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osTimerStop(*timer);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_is_running
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_is_running(const cy_timer_t* timer, bool* state)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((timer == NULL) || (state == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *state = osTimerIsRunning(*timer);
    }

    return status;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; this backend deinit updates handle state.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_deinit(cy_timer_t* timer)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osTimerDelete(*timer);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*timer);
            *timer = NULL;
        }
    }

    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Time
******************************************************/

cy_rslt_t cy_rtos_time_get(cy_time_t* tval)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t  tick_freq;

    if (tval == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Get Number of ticks per second
        tick_freq = osKernelGetTickFreq();

        // Convert ticks count to time in milliseconds
        if (tick_freq != 0)
        {
            *tval = (cy_time_t)((osKernelGetTickCount() * 1000LL) / tick_freq);
        }
        else
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_delay_milliseconds
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_delay_milliseconds(cy_time_t num_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    statusInternal = osDelay(num_ms);
    status         = error_converter(statusInternal);

    return status;
}


#if defined(__cplusplus)
}
#endif
